
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии", Истина);
	Отбор = Новый Структура("Документ", ПараметрКоманды);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
