
&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	
	РассчитатьДанныеТЧ("Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	РассчитатьДанныеТЧ("Цена");
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСуммаПриИзменении(Элемент)
	РассчитатьДанныеТЧ("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДанныеТЧ(ИмяКолонки)

	ТекДанные = Элементы.Номенклатура.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ИмяКолонки = "Сумма" Тогда
		ТекДанные.Цена = ?(ТекДанные.Количество = 0, 0, ТекДанные.Сумма/ТекДанные.Количество);
	Иначе
		ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
	КонецЕсли; 

КонецПроцедуры // РассчитатьДанныеТЧ()
 